[{
    "narration": "On the authority of Omar bin Al-Khattab, who said : I heared the messenger of Allah salla Allah u alihi wa sallam say:",
    "hadith": "Actions are but by intention and every man shall have but that which he intended. Thus he whose migration was for Allah and His messenger, his migration was for Allah and His messenger, and he whose migration was to achieve some worldly benefit or to take some woman in marriage, his migration was for that for which he migrated.",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "On the authority of Ibn Omar, the son of Omar bin Al-Khattab, may Allah be pleased with both, who said: I heared the messenger of Allah say:",
    "hadith": "Islam has been built on five [pillars]: testifying that there is no god but Allah and that Muhammed is the messenger of Allah, performing the prayers, paying the zakat, making the pilgrimage to the House, and fasting in Ramadan.",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "On the authority of Aishah, who said : The messenger of Allah said:",
    "hadith": "He who innovates something in this matter of ours that is not of it will have it rejected.",
    "book": "narrated by Bukhari and Muslim"
},
{
    "narration": "On the authority of Tamim Al-Dari that the prophet said:",
    "hadith": "'Religion is sincerity'. We said: 'To whom?' He said: 'To Allah and His Book, and His messenger, and to the leaders of the Muslims and their common folk'.",
    "book": "narrated by Muslim"
},
{
    "narration": "Abdullah bin Omar narrated that the messenger of Allah said:",
    "hadith": "I have been ordered to fight against people until they testify that there is no god but Allah and that Muhammed is the messenger of Allah and until they perform the prayers and pay the zakat, and if they do so they will have gained protection from me for their lives and property, unless [they do acts that are punishable] in accordance with Islam, and their reckoning will be with Allah the Almighty",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "On the authority of Abu Hurairah, who said : I heared the messenger of Allah say:",
    "hadith": "What I have forbidden to you, avoid; what I have ordered you [to do], do as much of it as you can. It was only their excessive questioning and their disagreeing with their prophets that destroyed those who were before you.",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "On the authority of Abu Hurairah, who said : The messenger of Allah said:",
    "hadith": "Part of someone's being a good Muslim is his leaving alone that which does not concern him.",
    "book": "narrated by Tirmithi"
},
{
    "narration": "On the authority of Anas bin Malik, the servant of the messenger of Allah, that the prophet said",
    "hadith": "None of you [truely] believes until he wishes for his brother what he wishes for himself.",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "Abu Hurairah narrated that the messenger of Allah said :",
    "hadith": "Let him who believes in Allah and the Last Day either speak good or keep silent, and let him who believes in Allah and the Last Day be generous to his neighbour, and let him who believes in Allah and the Last Day be generous to his guest.",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "On the authority of Abu Dhar Jundub bin Junadah, and Muadh bin Jabal that the messenger of Allah said ",
    "hadith": "Fear Allah wherever you are, and follow up a bad deed with a good one and it will wipe it out, and behave well towards people.",
    "book": "narrated by Tirmithi"
},
{
    "narration": "On the authority of Abu Hurairah, who said: The messenger of Allah said :",
    "hadith": "Each person's every joint must perform a charity every day the sun comes up : to act justly between two people is a charity; to help a man with his mount, lifting him onto it or hoistingd up his belongings onto it is a charity: a good word is a charity, every step you take to prayers is a charity and removing a harmful thing from the road is a charity.",
    "book": "related by Bukhari and Muslim"
},
{
    "narration": "On the authority of Al-Nawwas bin Samaan, that the prophet said:",
    "hadith": "Righteousness is good morality, and wrongdoing is that which wavers in your soul and which you dislike people finding out about.",
    "book": "related by Muslim"
},
{
    "narration": "On the authority of Jurthum bin Nashir that the messenger of Allah said :",
    "hadith": "Allah the Almighty has laid down religious duties, so do not neglict them. He has set boundaries, so do not over step them. He has prohibited some things, so do not violate them; about some things He was silent-out of compassion for you, not forgetfulness, so seek not after them.",
    "book": "related by Al-Daraqutni and others"
},
{
    "narration": "On the authority of Abu Saeed Al-Khurdari, who said: I heard the messenger of Allah say:",
    "hadith": "Whosoever of you sees an evil action, let him change it with his hand; and if he is not able to do so, then with his tongue; and if he is not able to do so, then with his heart; and that is the weakest of faith.",
    "book": "related by Muslim"
}
]